<div>
    @if($createPart===0)
    <div class="content">
        <section>
            <!-- <div class="title">
                ایجاد جلسه
            </div> -->
            <div class="boxes">
                <div class="item-box vebinar">
                    <img src="./client/assets/images/Conference speaker-pana (2) 1.png" width="250" height="250"
                        alt="">
                    <p>وبینار</p>
                    <span>برای ایجاد وبینار لطفا کلیک کنید</span>
                    <a  href="#"> وبینار</a>
                </div>
                <div class="item-box confronce">
                    <img src="./client/assets/images/Conference-pana (1) 1.png" width="250" height="250" alt="">
                    <p>کنفرانس</p>
                    <span>برای ایجاد کنفرانس لطفا کلیک کنید</span>
                    <a wire:click="changeCreateStatus(1)" class="link-mouse-hover"> کنفرانس</a>
                </div>
                <div class="item-box vebinar">
                    <img src="./client/assets/images/Meeting-amico 1 (1).png" width="250" height="250" alt="">
                    <p>حضوری</p>
                    <span>برای ایجاد جلسه حضوری لطفا کلیک کنید</span>
                    <a > حضوری</a>
                </div>
            </div>
        </section>
    </div>
    @elseif($createPart===1)
    <div class="content">
        <section>
            <div class="title">
                <div wire:click="changeCreateStatus(0)" class="back">
                    <!-- <p>ایجاد جلسه</p>
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M0 12C0 14.3734 0.703789 16.6934 2.02237 18.6668C3.34094 20.6402 5.21508 22.1783 7.4078 23.0865C9.60051 23.9948 12.0133 24.2324 14.3411 23.7694C16.6689 23.3064 18.807 22.1635 20.4853 20.4853C22.1635 18.807 23.3064 16.6689 23.7694 14.3411C24.2324 12.0133 23.9948 9.60051 23.0865 7.4078C22.1783 5.21508 20.6402 3.34094 18.6668 2.02237C16.6934 0.703789 14.3734 0 12 0C8.81846 0.00344086 5.76821 1.26883 3.51852 3.51852C1.26883 5.76821 0.00344086 8.81846 0 12ZM22 12C22 13.9778 21.4135 15.9112 20.3147 17.5557C19.2159 19.2002 17.6541 20.4819 15.8268 21.2388C13.9996 21.9957 11.9889 22.1937 10.0491 21.8078C8.10929 21.422 6.32746 20.4696 4.92893 19.0711C3.53041 17.6725 2.578 15.8907 2.19214 13.9509C1.80629 12.0111 2.00433 10.0004 2.7612 8.17316C3.51808 6.3459 4.7998 4.78412 6.4443 3.6853C8.08879 2.58649 10.0222 2 12 2C14.6513 2.00291 17.1931 3.05741 19.0678 4.93215C20.9426 6.80688 21.9971 9.34873 22 12Z"
                            fill="#666666" />
                        <path
                            d="M16 11.9995C16.0007 12.7315 15.7332 13.4384 15.248 13.9865C14.957 14.3135 14.674 14.6235 14.471 14.8265L11.647 17.6995C11.4588 17.8763 11.2095 17.9735 10.9513 17.9706C10.6931 17.9678 10.446 17.8652 10.2617 17.6843C10.0775 17.5034 9.97031 17.2582 9.96272 17.0001C9.95513 16.742 10.0477 16.4909 10.221 16.2995L13.05 13.4195C13.237 13.2315 13.491 12.9515 13.75 12.6605C13.9111 12.4778 14.0001 12.2426 14.0001 11.999C14.0001 11.7554 13.9111 11.5202 13.75 11.3375C13.492 11.0475 13.238 10.7675 13.057 10.5855L10.221 7.69952C10.0477 7.50811 9.95513 7.25706 9.96272 6.99895C9.97031 6.74084 10.0775 6.49567 10.2617 6.31476C10.446 6.13386 10.6931 6.03124 10.9513 6.0284C11.2095 6.02556 11.4588 6.12272 11.647 6.29952L14.476 9.17752C14.676 9.37752 14.956 9.68452 15.245 10.0105C15.732 10.5585 16.0007 11.2664 16 11.9995Z"
                            fill="#666666" />
                    </svg> -->
                </div>
            </div>
            @if($this->level===1)
            <div class="boxes">
                <form class="box" wire:submit.prevent="createSession">
                    <div class="title">
                        <p>عنوان جلسه</p>
                        <button > بعدی</button>
                    </div>
                    <div class="name-session">
                        <input class="@error('name') is-invalid @enderror" wire:model="name" name="name" type="search" placeholder="عنوان جلسه را وارد کنید">
                        @error('name') <span class="invalid-feedback">{{ $message }}</span> @enderror
                    </div>
                    <div class="type-session">
                        <label for="">نوع جلسه</label>
                        <div class="check-type">
                            <div class="item">
                                <input class="accent" type="checkbox" wire:click="changeSessionState(1)" {{ $session_type==0 ? 'checked' : '' }}>
                                <span>جلسه عمومی</span>
                            </div>
                            <div class="item sec">
                                <input class="accent" type="checkbox" wire:click="changeSessionState(0)" {{ $session_type==1 ? 'checked' : '' }}>
                                <span>جلسه خصوصی</span>
                            </div>
                        </div>
                    </div>
                    <div class="date-session">
                        <div class="item">
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M15.4167 1.66667H15V1.25C15 0.918479 14.8683 0.600537 14.6339 0.366117C14.3995 0.131696 14.0815 0 13.75 0C13.4185 0 13.1005 0.131696 12.8661 0.366117C12.6317 0.600537 12.5 0.918479 12.5 1.25V1.66667H7.5V1.25C7.5 0.918479 7.3683 0.600537 7.13388 0.366117C6.89946 0.131696 6.58152 0 6.25 0C5.91848 0 5.60054 0.131696 5.36612 0.366117C5.1317 0.600537 5 0.918479 5 1.25V1.66667H4.58333C3.36776 1.66667 2.20197 2.14955 1.34243 3.00909C0.482886 3.86864 0 5.03442 0 6.25L0 15.4167C0 16.6322 0.482886 17.798 1.34243 18.6576C2.20197 19.5171 3.36776 20 4.58333 20H15.4167C16.6322 20 17.798 19.5171 18.6576 18.6576C19.5171 17.798 20 16.6322 20 15.4167V6.25C20 5.03442 19.5171 3.86864 18.6576 3.00909C17.798 2.14955 16.6322 1.66667 15.4167 1.66667ZM15.4167 17.5H4.58333C4.0308 17.5 3.5009 17.2805 3.11019 16.8898C2.71949 16.4991 2.5 15.9692 2.5 15.4167V8.33333H17.5V15.4167C17.5 15.9692 17.2805 16.4991 16.8898 16.8898C16.4991 17.2805 15.9692 17.5 15.4167 17.5Z"
                                    fill="black" />
                            </svg>
                            <p>تاریخ جلسه</p>
                            <div class="input_wrapper">
                                <input wire:model="start_date" name="start_date" class="time_input @error('start_date') is-invalid @enderror" type="date" placeholder="12 فروردین" >
                                @error('start_date') <span class="invalid-feedback">{{ $message }}</span> @enderror
                            </div>
                        </div>
                       
                    </div>
                    <div class="date-session">
                        <div class="item">
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M20 10C20 12.6522 18.9464 15.1957 17.0711 17.0711C15.1957 18.9464 12.6522 20 10 20C7.34784 20 4.8043 18.9464 2.92893 17.0711C1.05357 15.1957 0 12.6522 0 10C0 9.66848 0.131696 9.35054 0.366117 9.11612C0.600537 8.8817 0.918479 8.75 1.25 8.75C1.58152 8.75 1.89946 8.8817 2.13388 9.11612C2.3683 9.35054 2.5 9.66848 2.5 10C2.5 11.4834 2.93987 12.9334 3.76398 14.1668C4.58809 15.4001 5.75943 16.3614 7.12987 16.9291C8.50032 17.4968 10.0083 17.6453 11.4632 17.3559C12.918 17.0665 14.2544 16.3522 15.3033 15.3033C16.3522 14.2544 17.0665 12.918 17.3559 11.4632C17.6453 10.0083 17.4968 8.50032 16.9291 7.12987C16.3614 5.75943 15.4001 4.58809 14.1668 3.76398C12.9334 2.93987 11.4834 2.5 10 2.5C9.66848 2.5 9.35054 2.3683 9.11612 2.13388C8.8817 1.89946 8.75 1.58152 8.75 1.25C8.75 0.918479 8.8817 0.600537 9.11612 0.366117C9.35054 0.131696 9.66848 0 10 0C12.6513 0.00286757 15.1932 1.05736 17.0679 2.9321C18.9426 4.80684 19.9971 7.34871 20 10ZM5.83333 10C5.83333 10.3315 5.96503 10.6495 6.19945 10.8839C6.43387 11.1183 6.75181 11.25 7.08333 11.25H8.90833C9.22493 11.5287 9.63578 11.6763 10.0573 11.6629C10.4789 11.6495 10.8795 11.476 11.1778 11.1778C11.476 10.8795 11.6495 10.4789 11.6629 10.0573C11.6763 9.63578 11.5287 9.22493 11.25 8.90833V5.41667C11.25 5.08515 11.1183 4.7672 10.8839 4.53278C10.6495 4.29836 10.3315 4.16667 10 4.16667C9.66848 4.16667 9.35054 4.29836 9.11612 4.53278C8.8817 4.7672 8.75 5.08515 8.75 5.41667V8.75H7.08333C6.75181 8.75 6.43387 8.8817 6.19945 9.11612C5.96503 9.35054 5.83333 9.66848 5.83333 10ZM5.61667 4.07833C5.86389 4.07833 6.10557 4.00502 6.31113 3.86767C6.51669 3.73032 6.67691 3.5351 6.77152 3.30669C6.86613 3.07828 6.89088 2.82695 6.84265 2.58447C6.79442 2.34199 6.67537 2.11927 6.50055 1.94445C6.32574 1.76963 6.10301 1.65058 5.86053 1.60235C5.61805 1.55412 5.36672 1.57887 5.13831 1.67348C4.9099 1.76809 4.71468 1.92831 4.57733 2.13387C4.43998 2.33943 4.36667 2.58111 4.36667 2.82833C4.36667 3.15985 4.49836 3.4778 4.73278 3.71222C4.9672 3.94664 5.28515 4.07833 5.61667 4.07833ZM2.4275 7.29167C2.67473 7.29167 2.9164 7.21836 3.12196 7.081C3.32752 6.94365 3.48774 6.74843 3.58235 6.52002C3.67696 6.29161 3.70171 6.04028 3.65348 5.7978C3.60525 5.55533 3.4862 5.3326 3.31138 5.15778C3.13657 4.98297 2.91384 4.86392 2.67136 4.81569C2.42889 4.76745 2.17755 4.79221 1.94915 4.88682C1.72074 4.98143 1.52551 5.14164 1.38816 5.3472C1.25081 5.55277 1.1775 5.79444 1.1775 6.04167C1.1775 6.37319 1.3092 6.69113 1.54362 6.92555C1.77804 7.15997 2.09598 7.29167 2.4275 7.29167Z"
                                    fill="black" />
                            </svg>
                            <p>زمان جلسه</p>
                            <div class="input_wrapper">
                                <input wire:model="start_time" name="start_time" class="time_input @error('start_time') is-invalid @enderror" type="time" placeholder="12-2-13">
                                @error('start_time') <span class="invalid-feedback">{{ $message }}</span> @enderror
                            </div>
                        </div>
                        
                    </div>
                    <!-- <div class="submit-details">
                        <button>بعدی </button>
                        <div class="share-box">
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M15.8333 11.6668C14.601 11.6714 13.4348 12.2246 12.6516 13.176L8.15162 11.1443C8.26608 10.7735 8.32725 10.3883 8.3333 10.0002C8.32791 9.61634 8.26873 9.23514 8.15748 8.86772L12.6525 6.82609C14.1342 8.56984 16.749 8.78229 18.4928 7.30065C20.2366 5.819 20.449 3.20426 18.9673 1.46051C17.4856 -0.283236 14.8708 -0.495731 13.127 0.985953C12.1942 1.77855 11.6597 2.94302 11.6667 4.16701C11.6667 4.28533 11.6917 4.39701 11.7017 4.51282L6.74999 6.76027C6.01999 6.1654 5.10835 5.83838 4.16667 5.83361C1.8655 5.83361 0 7.69904 0 10.0002C0 12.3014 1.86546 14.1668 4.16667 14.1668C5.10429 14.1629 6.01257 13.8396 6.74167 13.2501L11.7017 15.4892C11.6917 15.6051 11.6667 15.7159 11.6667 15.8334C11.6667 18.1345 13.5321 20 15.8333 20C18.1345 20 20 18.1346 20 15.8334C20 13.5323 18.1345 11.6668 15.8333 11.6668ZM15.8333 2.50041C16.7538 2.50041 17.5 3.2466 17.5 4.16705C17.5 5.0875 16.7538 5.83369 15.8333 5.83369C14.9128 5.83369 14.1666 5.0875 14.1666 4.16705C14.1666 3.2466 14.9128 2.50041 15.8333 2.50041ZM4.16667 11.6668C3.2462 11.6668 2.49999 10.9206 2.49999 10.0002C2.49999 9.07975 3.2462 8.33356 4.16667 8.33356C5.08714 8.33356 5.83335 9.07975 5.83335 10.0002C5.83335 10.9206 5.08714 11.6668 4.16667 11.6668ZM15.8333 17.5001C14.9128 17.5001 14.1666 16.7539 14.1666 15.8334C14.1666 14.9129 14.9128 14.1668 15.8333 14.1668C16.7538 14.1668 17.5 14.9129 17.5 15.8334C17.5 16.7539 16.7538 17.5001 15.8333 17.5001Z"
                                    fill="#00AFD6" />
                            </svg>
                        </div>
                        <div class="mail-box">
                            <svg width="20" height="19" viewBox="0 0 20 19" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M15.4167 0H4.58333C3.36816 0.00132347 2.20314 0.484634 1.34389 1.34389C0.484634 2.20314 0.00132347 3.36816 0 4.58333L0 13.75C0.00132347 14.9652 0.484634 16.1302 1.34389 16.9894C2.20314 17.8487 3.36816 18.332 4.58333 18.3333H15.4167C16.6318 18.332 17.7969 17.8487 18.6561 16.9894C19.5154 16.1302 19.9987 14.9652 20 13.75V4.58333C19.9987 3.36816 19.5154 2.20314 18.6561 1.34389C17.7969 0.484634 16.6318 0.00132347 15.4167 0ZM15.4167 2.5C15.9221 2.50168 16.4092 2.68879 16.7858 3.02583L11.3692 8.4425C11.0013 8.79389 10.5121 8.98996 10.0033 8.98996C9.49458 8.98996 9.0054 8.79389 8.6375 8.4425L3.22083 3.02583C3.59571 2.69031 4.08025 2.50331 4.58333 2.5H15.4167ZM15.4167 15.8333H4.58333C4.0308 15.8333 3.5009 15.6138 3.11019 15.2231C2.71949 14.8324 2.5 14.3025 2.5 13.75V5.8475L6.86583 10.2133C7.2773 10.625 7.76584 10.9515 8.30353 11.1743C8.84123 11.3971 9.41756 11.5118 9.99958 11.5118C10.5816 11.5118 11.1579 11.3971 11.6956 11.1743C12.2333 10.9515 12.7219 10.625 13.1333 10.2133L17.5 5.8475V13.75C17.5 14.3025 17.2805 14.8324 16.8898 15.2231C16.4991 15.6138 15.9692 15.8333 15.4167 15.8333Z"
                                    fill="#FF9928" />
                            </svg>
                        </div>
                    </div> -->
                </form>
                <div class="box2">
                <div class="inside-box">
                <img src="./client/assets/images/Conference-pana (1) 1.png" width="250" height="250" alt="">
                    <p>کنفرانس</p>
                    <span>روابط قوی‌تری ایجاد کنید، همکاری‌های فوق‌العاده‌ای ایجاد کنید و تجربه‌ای جذاب از جلسه را با ویدیو و صدای HD برای حداکثر 1000 شرکت‌کننده ایجاد کنید.</span>
                   
                    </div>
                </div>
            </div>
            @elseif($this->level===2)

            <div class="box-addContact" id="clsModal">
                <div class="box-addContact-container">
                    
                    <div class="title">
                        <button class="link-mouse-hover" wire:click="changeToSendMessages">بعدی</button>
                        <div>
                        <select class="dropdown-content link-mouse-hover">
                            @if(!$this->categories==null)
                            <option wire:click.prevent="getAllContacts">همه دسته بندی ها</option>
                                @foreach ($categories as $category)
                                    <option wire:click="selectedCategory({{ $category->id }})" >{{ $category->name }}</option>
                                @endforeach
                            @else
                                <option >دسنه بندی وجود ندارد</option>
                            @endif
                </select>
                        </div>
                    </div>
                    <div class="search">
                        <input wire:keydown="getAllContacts" type="text" wire:model="search" placeholder="جست و جو در مخاطبین">
                        <svg  width="20" height="21" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M19.635 17.8725L15.7637 13.9996C18.6604 10.1286 17.8706 4.64234 13.9996 1.74566C10.1286 -1.15102 4.64234 -0.361187 1.74566 3.50978C-1.15102 7.38076 -0.361187 12.8671 3.50979 15.7637C6.61927 18.0906 10.8901 18.0906 13.9996 15.7637L17.8725 19.6366C18.3592 20.1233 19.1483 20.1233 19.635 19.6366C20.1217 19.1499 20.1217 18.3609 19.635 17.8742L19.635 17.8725ZM8.78697 15.0162C5.34663 15.0162 2.55772 12.2273 2.55772 8.78697C2.55772 5.34663 5.34663 2.55772 8.78697 2.55772C12.2273 2.55772 15.0162 5.34663 15.0162 8.78697C15.0126 12.2257 12.2258 15.0126 8.78697 15.0162Z"
                                fill="#4D4D4D" />
                        </svg>
                    </div>

                    <!-- <div class="contacts">
                        <div class="title-contacts">
                            <p>انتخات</p>
                            <p>نام و نام خانوادگی</p>
                            <p>شماره موبایل</p>
                            <p>مدرس</p>
                        </div>
                        <div class="items-contact">
                            @if(!$contacts==null)
                                @foreach ($contacts as $con)
                                    <div class="item-contact" style="display: flex;justify-content: space-between;">
                                        <div>
                                            <input class="accent" type="checkbox" wire:click="addUsersToSession({{ $con->id }})" >
                                        </div>
                                        <div>
                                            <p>{{ $con->username }}</p>
                                        </div>
                                        <div>
                                            <p style="font-size: small;">{{ $con->phone }}</p>
                                        </div>
                                        <div>
                                            <p>
                                                <input wire:click="changeOstadFlag({{ $con->id }})" name="ostad_flag" class="accent" type="radio">
                                            </p>
                                        </div>
                                    </div>
                                @endforeach
                            @else
                                <p >کاربری وجود ندارد</p>
                            @endif   
                        </div>
                    </div>
                     -->

                     <div class="table">
                        <table class="tablecontacts">
                            <tr>
                                <th>انتخاب</th>
                                <th>نام مخاطب</th>
                                <th>شماره موبایل</th>
                                <th>سمت</th>
                                <th>مدرس</th>
                                
                                
                            </tr>
                            @if(!$contacts==null)
                            @foreach($contacts as $contact)
                                <tr>
                                    <td>
                                        <input class="accent" type="checkbox" wire:click="addUsersToSession({{ $contact->id }})" >
                                    </td>
                                    <td>
                                        {{ $contact->username }}
                                    </td>
                                    <td>
                                        {{ $contact->phone }}
                                    </td>
                                    <td>
                                        {{ $contact->semat }}
                                    </td>
                                    <td>
                                        <input wire:click="changeOstadFlag({{ $contact->id }})" name="ostad_flag" class="accent" type="radio">
                                    </td>
                                </tr>
                            @endforeach
                            @else
                                <p >کاربری وجود ندارد</p>
                            @endif
                        </table>
                    </div>
    <!-- ////////////////////// -->
                </div>
            </div>
            @elseif($this->level===3)
             <div class="boxes">
                <form class="box3" wire:submit.prevent="createSession">
                    <div class="title">
                        <p> ارسال پیام به مخاطبان</p>
                        
                    </div>
                    
                    <div class="submit-details">
                        <button>ارسال پیام </button>
                        
                    </div>
                </form>
            </div> 
            @endif
        </section>

    </div>
    @endif
</div>
